[
  {
    "igHandle": "@starrySkylar",
    "followerCount": 2387654,
    "aqs": 82,
    "description": "Starry Skylar's engaging posts and high aesthetic appeal make them ideal for campaigns targeting young parents and families. They excel in image-based content showcasing baby products and lifestyle items."
  },
  {
    "igHandle": "@glamMaddox",
    "followerCount": 6543210,
    "aqs": 75,
    "description": "Glam Maddox's strong follower base and expertise in health and wellness make them perfect for fitness and nutrition campaigns. Their Instagram Stories are particularly effective at conveying detailed information."
  },
  {
    "igHandle": "@jazzyJaxon",
    "followerCount": 1234567,
    "aqs": 91,
    "description": "Jazzy Jaxon is known for creative and fun reels that engage younger audiences, making them perfect for toy and entertainment campaigns."
  },
  {
    "igHandle": "@radiantRiley",
    "followerCount": 8765432,
    "aqs": 69,
    "description": "Radiant Riley's high follower count and engaging visuals make them suitable for sports and fitness campaigns. Their images often receive high engagement, inspiring followers to lead an active lifestyle."
  },
  {
    "igHandle": "@stellarSloane",
    "followerCount": 3456789,
    "aqs": 85,
    "description": "Stellar Sloane is highly effective in promoting baby products, with a high engagement rate on image posts. Their content resonates well with parents and caregivers."
  },
  {
    "igHandle": "@cosmicCaden",
    "followerCount": 5678901,
    "aqs": 78,
    "description": "Cosmic Caden's dynamic storytelling in Instagram Stories makes them a great fit for health and fitness campaigns. Their followers trust their advice and recommendations."
  },
  {
    "igHandle": "@dazzlingDylan",
    "followerCount": 4321098,
    "aqs": 88,
    "description": "Dazzling Dylan's creative reels are perfect for toy promotions. They are known for their high engagement rates and fun, playful content that captivates younger audiences."
  },
  {
    "igHandle": "@vividVivian",
    "followerCount": 7654321,
    "aqs": 72,
    "description": "Vivid Vivian excels in sports-related content, especially images. Their active lifestyle posts inspire followers and drive high engagement, making them ideal for sports and fitness campaigns."
  },
  {
    "igHandle": "@electricEmery",
    "followerCount": 9876543,
    "aqs": 94,
    "description": "Electric Emery's high-quality reels and fitness expertise make them ideal for health campaigns. Their content is both informative and engaging, attracting a wide range of followers."
  },
  {
    "igHandle": "@luminousLuca",
    "followerCount": 2345678,
    "aqs": 81,
    "description": "Luminous Luca's charming image posts are perfect for baby product promotions. Their content is relatable for new parents and often receives high engagement."
  },
  {
    "igHandle": "@majesticMilo",
    "followerCount": 5678902,
    "aqs": 65,
    "description": "Majestic Milo's detailed and motivational stories make them a great fit for sports campaigns. Their followers appreciate their fitness journey and the authenticity of their content."
  },
  {
    "igHandle": "@radiantRowan",
    "followerCount": 8765433,
    "aqs": 79,
    "description": "Radiant Rowan's engaging reels are perfect for promoting toys. Their playful content attracts a wide range of followers, making them ideal for family and entertainment campaigns."
  },
  {
    "igHandle": "@glitzGio",
    "followerCount": 3456790,
    "aqs": 93,
    "description": "Glitz Gio's visually appealing health-related posts have shown high engagement. They are a trusted source for wellness advice and are particularly effective in image-based campaigns."
  },
  {
    "igHandle": "@shimmerShay",
    "followerCount": 1234568,
    "aqs": 87,
    "description": "Shimmer Shay's motivational stories are perfect for sports campaigns. They excel in engaging their audience through detailed content and fitness challenges."
  },
  {
    "igHandle": "@sparkleSage",
    "followerCount": 6543211,
    "aqs": 73,
    "description": "Sparkle Sage's charming images make them ideal for baby product promotions. Their content is heartwarming and relatable for parents, driving high engagement."
  },
  {
    "igHandle": "@twinkleTate",
    "followerCount": 2345679,
    "aqs": 80,
    "description": "Twinkle Tate's engaging reels have a strong focus on health and wellness. Their content is both informative and visually appealing, making them ideal for health campaigns."
  },
  {
    "igHandle": "@glowGrayson",
    "followerCount": 4321099,
    "aqs": 91,
    "description": "Glow Grayson's fun and interactive stories make them perfect for toy campaigns. Their content always captures the audience's attention and encourages engagement."
  },
  {
    "igHandle": "@flashFinley",
    "followerCount": 8765434,
    "aqs": 68,
    "description": "Flash Finley's high-quality images are perfect for sports and fitness campaigns. Their content is motivational and inspires followers to stay active."
  },
  {
    "igHandle": "@gleamGage",
    "followerCount": 9876544,
    "aqs": 84,
    "description": "Gleam Gage's expertise in health and wellness makes them ideal for fitness campaigns. Their content is both informative and engaging, attracting a dedicated follower base."
  },
  {
    "igHandle": "@shineShiloh",
    "followerCount": 5678903,
    "aqs": 76,
    "description": "Shine Shiloh's detailed and motivational stories make them a great fit for health campaigns. Their followers appreciate their fitness journey and the authenticity of their content."
  },
  {
    "igHandle": "@brightBriar",
    "followerCount": 1234569,
    "aqs": 89,
    "description": "Bright Briar's creative and engaging content makes them perfect for toy and entertainment campaigns. Their high engagement rates make them a valuable influencer."
  },
  {
    "igHandle": "@radiantRemi",
    "followerCount": 7654322,
    "aqs": 95,
    "description": "Radiant Remi's high-quality health and fitness posts make them ideal for wellness campaigns. Their content is both motivational and visually appealing, attracting a wide range of followers."
  },
  {
    "igHandle": "@glitterGwen",
    "followerCount": 2345680,
    "aqs": 70,
    "description": "Glitter Gwen's charming images make them ideal for baby product promotions. Their content is heartwarming and relatable for parents, driving high engagement."
  },
  {
    "igHandle": "@sparklySawyer",
    "followerCount": 3456791,
    "aqs": 83,
    "description": "Sparkly Sawyer's creative reels are perfect for toy promotions. They are known for their high engagement rates and fun, playful content that captivates younger audiences."
  },
  {
    "igHandle": "@brilliantBlaire",
    "followerCount": 4321100,
    "aqs": 77,
    "description": "Brilliant Blaire's high-quality images are perfect for sports and fitness campaigns. Their content is motivational and inspires followers to stay active."
  },
  {
    "igHandle": "@dazzlingDrew",
    "followerCount": 6543212,
    "aqs": 92,
    "description": "Dazzling Drew's visually appealing health-related posts have shown high engagement. They are a trusted source for wellness advice and are particularly effective in image-based campaigns."
  },
  {
    "igHandle": "@radiantReese",
    "followerCount": 9876545,
    "aqs": 66,
    "description": "Radiant Reese's detailed and motivational stories make them a great fit for health campaigns. Their followers appreciate their fitness journey and the authenticity of their content."
  },
  {
    "igHandle": "@glowGio",
    "followerCount": 5678904,
    "aqs": 90,
    "description": "Glow Gio's high-quality health and fitness posts make them ideal for wellness campaigns. Their content is both motivational and visually appealing, attracting a wide range of followers."
  },
  {
    "igHandle": "@gleamGio",
    "followerCount": 8765435,
    "aqs": 74,
    "description": "Gleam Gio's expertise in health and wellness makes them ideal for fitness campaigns. Their content is both informative and engaging, attracting a dedicated follower base."
  },
  {
    "igHandle": "@flashFin",
    "followerCount": 3456792,
    "aqs": 86,
    "description": "Flash Fin's high-quality images are perfect for sports and fitness campaigns. Their content is motivational and inspires followers to stay active."
  },
  {
    "igHandle": "@shinyShay",
    "followerCount": 1234570,
    "aqs": 71,
    "description": "Shiny Shay's charming images make them ideal for baby product promotions. Their content is heartwarming and relatable for parents, driving high engagement."
  },
  {
    "igHandle": "@sparkleSloane",
    "followerCount": 6543213,
    "aqs": 82,
    "description": "Sparkle Sloane's creative and engaging content makes them perfect for toy and entertainment campaigns. Their high engagement rates make them a valuable influencer."
  },
  {
    "igHandle": "@brilliantBryce",
    "followerCount": 2345681,
    "aqs": 93,
    "description": "Brilliant Bryce's high-quality health and fitness posts make them ideal for wellness campaigns. Their content is both motivational and visually appealing, attracting a wide range of followers."
  },
  {
    "igHandle": "@radiantRory",
    "followerCount": 4321101,
    "aqs": 75,
    "description": "Radiant Rory's engaging reels are perfect for promoting toys. Their playful content attracts a wide range of followers, making them ideal for family and entertainment campaigns."
  },
  {
    "igHandle": "@dazzlingDrew",
    "followerCount": 8765436,
    "aqs": 88,
    "description": "Dazzling Drew's creative reels are perfect for toy promotions. They are known for their high engagement rates and fun, playful content that captivates younger audiences."
  },
  {
    "igHandle": "@glamGrayson",
    "followerCount": 9876546,
    "aqs": 67,
    "description": "Glam Grayson's dynamic storytelling in Instagram Stories makes them a great fit for health and fitness campaigns. Their followers trust their advice and recommendations."
  },
  {
    "igHandle": "@shimmerSawyer",
    "followerCount": 5678905,
    "aqs": 79,
    "description": "Shimmer Sawyer's motivational stories are perfect for sports campaigns. They excel in engaging their audience through detailed content and fitness challenges."
  },
  {
    "igHandle": "@gleamGwen",
    "followerCount": 1234571,
    "aqs": 94,
    "description": "Gleam Gwen's high-quality reels and fitness expertise make them ideal for health campaigns. Their content is both informative and engaging, attracting a wide range of followers."
  },
  {
    "igHandle": "@glitterGio",
    "followerCount": 7654323,
    "aqs": 83,
    "description": "Glitter Gio's creative and engaging content makes them perfect for toy and entertainment campaigns. Their high engagement rates make them a valuable influencer."
  },
  {
    "igHandle": "@sparklySage",
    "followerCount": 2345682,
    "aqs": 70,
    "description": "Sparkly Sage's charming images make them ideal for baby product promotions. Their content is heartwarming and relatable for parents, driving high engagement."
  },
  {
    "igHandle": "@brightBlaire",
    "followerCount": 3456793,
    "aqs": 89,
    "description": "Bright Blaire's creative and engaging content makes them perfect for toy and entertainment campaigns. Their high engagement rates make them a valuable influencer."
  },
  {
    "igHandle": "@twinkleTate",
    "followerCount": 4321102,
    "aqs": 76,
    "description": "Twinkle Tate's engaging reels have a strong focus on health and wellness. Their content is both informative and visually appealing, making them ideal for health campaigns."
  },
  {
    "igHandle": "@radiantRiley",
    "followerCount": 9876547,
    "aqs": 92,
    "description": "Radiant Riley's high follower count and engaging visuals make them suitable for sports and fitness campaigns. Their images often receive high engagement, inspiring followers to lead an active lifestyle."
  },
  {
    "igHandle": "@glamGwen",
    "followerCount": 5678906,
    "aqs": 65,
    "description": "Glam Gwen's dynamic storytelling in Instagram Stories makes them a great fit for health and fitness campaigns. Their followers trust their advice and recommendations."
  },
  {
    "igHandle": "@flashFin",
    "followerCount": 8765437,
    "aqs": 90,
    "description": "Flash Fin's high-quality images are perfect for sports and fitness campaigns. Their content is motivational and inspires followers to stay active."
  },
  {
    "igHandle": "@shinyShay",
    "followerCount": 1234572,
    "aqs": 84,
    "description": "Shiny Shay's charming images make them ideal for baby product promotions. Their content is heartwarming and relatable for parents, driving high engagement."
  },
  {
    "igHandle": "@brilliantBryce",
    "followerCount": 7654324,
    "aqs": 71,
    "description": "Brilliant Bryce's high-quality health and fitness posts make them ideal for wellness campaigns. Their content is both motivational and visually appealing, attracting a wide range of followers."
  },
  {
    "igHandle": "@radiantRory",
    "followerCount": 2345683,
    "aqs": 80,
    "description": "Radiant Rory's engaging reels are perfect for promoting toys. Their playful content attracts a wide range of followers, making them ideal for family and entertainment campaigns."
  },
  {
    "igHandle": "@dazzlingDylan",
    "followerCount": 3456794,
    "aqs": 95,
    "description": "Dazzling Dylan's creative reels are perfect for toy promotions. They are known for their high engagement rates and fun, playful content that captivates younger audiences."
  },
  {
    "igHandle": "@shinyShiloh",
    "followerCount": 4321103,
    "aqs": 68,
    "description": "Shiny Shiloh's detailed and motivational stories make them a great fit for health campaigns. Their followers appreciate their fitness journey and the authenticity of their content."
  },
  {
    "igHandle": "@gleamGrayson",
    "followerCount": 9876548,
    "aqs": 78,
    "description": "Gleam Grayson's expertise in health and wellness makes them ideal for fitness campaigns. Their content is both informative and engaging, attracting a dedicated follower base."
  }
]
